Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособПодключенияДрайвера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СпособПодключенияДрайвера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзМакета</Name>
					<Comment>Установка драйвера осуществляется из макета конфигурации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛокальноПоИдентификатору</Name>
					<Comment>Подключатся драйвер, установленный на локальном компьютере по ProgID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзИнформационнойБазы</Name>
					<Comment>Установка драйвера осуществляется из информационной базы</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОборудованиеДисплеиПокупателяОбновление/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
// 
// Параметры:
//  ДрайвераОборудования - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя;
	Драйвер.ИмяДрайвера  = "Драйвер1СДисплейПокупателя";
	Драйвер.Наименование = НСтр("ru = '1С:Дисплей покупателя'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CustomerDisplayEx"; 
	Драйвер.ВерсияДрайвера = "4.2.2.8"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя;
	Драйвер.ИмяДрайвера  = "ДрайверАТОЛДисплеиПокупателя8X";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:Дисплеи покупателя 8.X'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ATOL_Line_1CInt"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя;
	Драйвер.ИмяДрайвера  = "ДрайверPOSUAДисплеиПокупателя";
	Драйвер.Наименование = НСтр("ru = 'POSUA:Дисплеи покупателя'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "LPOSVFD"; 
	Драйвер.ВерсияДрайвера = "1.0.8.0"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя;
	Драйвер.ИмяДрайвера  = "Драйвер1СРарусДисплеиПокупателя";
	Драйвер.Наименование = НСтр("ru = '1С-Рарус:Дисплеи покупателя'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "d_android1c83"; 
	Драйвер.ВерсияДрайвера = "1.0.15.54"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодДисплеиПокупателяNative";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Дисплеи покупателя (Native API)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "DSPPromag8"; 
	Драйвер.ВерсияДрайвера = "1.0.0.3"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя;
	Драйвер.ИмяДрайвера  = "ДрайверКристаллСервисДисплеиПокупателяVikiVision";
	Драйвер.Наименование = НСтр("ru = 'Кристалл Сервис:Дисплей покупателя Viki Vision'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "VikiVision"; 
	Драйвер.ВерсияДрайвера = "1.03"; 

	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя;
	Драйвер.ИмяДрайвера  = "ДрайверККСДисплеиПокупателя";
	Драйвер.Наименование = НСтр("ru = 'ККС:Дисплеи покупателя'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "VFCD220E"; 
	Драйвер.ВерсияДрайвера = "1.0.1.1"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя;
	Драйвер.ИмяДрайвера  = "ДрайверЭвоторДисплейПокупателя";
	Драйвер.Наименование = НСтр("ru = 'Эвотор:Дисплей покупателя'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "EvoKKMExtension36"; 
	Драйвер.ВерсияДрайвера = "1.9.412.3006"; 
	Драйвер.ИмяМакетаДрайвера = "ДрайверЭвоторККТ54ФЗ";
	
КонецПроцедуры

#КонецОбласти
